Revit 2027 API
BindingMap.ReInsert Method
Removes an existing parameter and creates a new binding for a given parameter.
Overload List
Name | Description
ReInsert(Definition, Binding) | Removes an existing parameter and creates a new binding for a given parameter.
ReInsert(Definition, Binding, ForgeTypeId) | Removes an existing parameter and creates a new binding for a given parameter in a specified group.
Top
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace